app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Sanchez"], ["updated_at", "2020-04-27 03:03:14.307623"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))